photon.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd"
[
<!ENTITY servers SYSTEM "servers.xml">
<!ENTITY sessions SYSTEM "sessions-limit.xml">
]
>
<tsung loglevel="info" dumptraffic="protocol" backend="fullstats" version="1.0">

  <!-- 
       Sample scenario
  -->
  <clients>
    <client host="localhost" use_controller_vm="true"/>
  </clients>

  &servers;
  
  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users interarrival="5" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
   <option name="file_server" id="address" value="data/addresses.csv" />
  </options>

  <sessions>
    <!-- sessions are descibed in entities -->
    &sessions;
  </sessions>
</tsung>